In [33]:
import pandas as pd

In [34]:
name = ['피카츄','라이츄','파이리',"꼬부기","버터풀","야도란","피죤투","또가스"]
department = ['경제','경영','컴공','컴공','경제','전전','컴공','기계']
lang = ['파이썬','C','C++','파이썬','자바','엄','파이썬','자바']
work = ['AI엔지니어','프론트','백엔드','AI엔지니어','백엔드','프론트','AI엔지니어','PM']

df_py = pd.DataFrame({'이름': name,'학과': department,'언어' : lang, '직무' : work})

In [35]:
df_py.iloc[[0,3,6],:]

    이름  학과   언어      직무
0  피카츄  경제  파이썬  AI엔지니어
3  꼬부기  컴공  파이썬  AI엔지니어
6  피죤투  컴공  파이썬  AI엔지니어

In [36]:
py_user = df_py[df_py["언어"] == "파이썬"]

In [37]:
py_user

    이름  학과   언어      직무
0  피카츄  경제  파이썬  AI엔지니어
3  꼬부기  컴공  파이썬  AI엔지니어
6  피죤투  컴공  파이썬  AI엔지니어

In [38]:
py_user2 = df_py[df_py["언어"].isin(["파이썬"])]
py_user2

    이름  학과   언어      직무
0  피카츄  경제  파이썬  AI엔지니어
3  꼬부기  컴공  파이썬  AI엔지니어
6  피죤투  컴공  파이썬  AI엔지니어

In [39]:
py_sp1 = df_py[(df_py['학과'] == '컴공') & (df_py['언어'] == '파이썬') & (df_py['직무'] =='AI엔지니어')]
py_sp1

    이름  학과   언어      직무
3  꼬부기  컴공  파이썬  AI엔지니어
6  피죤투  컴공  파이썬  AI엔지니어